tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "shopify/shopify"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Change macOS display brightness from the command-line
brew "brightness"
# Perl compatible regular expressions library
brew "pcre"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# UNIX movie player
brew "mplayer"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Shortcut for the 'ps aux | grep' idiom
brew "psgrep"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Tool to uninstall unwanted applications and their support files
cask "appzapper"
# Multi-cloud backup application
cask "arq"
# Records audio from any application
cask "audio-hijack"
# Data backup and storage service
cask "backblaze"
# App to manage bank accounts in one place
cask "banktivity"
# Menu bar icon organizer
cask "bartender"
# Utility to create and modify archives
cask "betterzip"
# Web browser focusing on privacy
cask "brave-browser"
# Synchronization and backup tool
cask "chronosync"
# Clipboard extension app
cask "clipy"
# App for building websites
cask "codekit"
cask "colloquy"
# API documentation browser and code snippet manager
cask "dash"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Tool to compare and synchronize files and folders
cask "deltawalker"
# App to build and share containerized applications and microservices
cask "docker"
# Downloads videos from different websites
cask "downie"
# Client for the Dropbox cloud storage service
cask "dropbox"
# VPN and encryption software
cask "encryptme"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Network drive and browser for cloud storage
cask "expandrive"
# Web browser
cask "firefox"
# Web browser
cask "firefox-nightly"
cask "font-fira-code"
cask "font-hack-nerd-font"
# App to assist with finding, tracking, and purchasing items on eBay
cask "garagebuy"
cask "garagesale"
# Git client focusing on productivity
cask "gitkraken"
cask "google-backup-and-sync"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Web browser
cask "google-chrome-dev"
# Tools to protect your emails and files
cask "gpg-suite"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Desktop automation application
cask "hammerspoon"
cask "hand-mirror"
# Time tracking application
cask "harvest"
# Automated organization
cask "hazel"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimize images to a smaller size
cask "imageoptim"
# iPhone management application
cask "imazing"
# App to organize screenshots and photos
cask "inboard"
cask "inssider"
# Tool to scans a website checking for broken links
cask "integrity"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# End-to-end encryption software
cask "keybase"
# Interface for reading and syncing eBooks
cask "kindle"
cask "knox"
# Music services manager
cask "lastfm"
# Productivity tool
cask "launchbar"
cask "livereload"
# Cable-free audio router
cask "loopback"
# Open-source Markdown editor
cask "macdown"
# IMAP email client
cask "mailmate"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked"
cask "mdimagesizemdimporter"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Note taking app
cask "nvalt"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scheduling application focusing on organization
cask "omnifocus"
# Note taking applciation and information organizer
cask "omnioutliner"
# Project planning and management software
cask "omniplan"
# Web browser
cask "opera"
# Web browser
cask "opera-developer"
# Converts and edits video, audio or image files
cask "permute"
# Used to access context-specific actions when text is selected
cask "popclip"
# Wireless printing to any printer
cask "printopia"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
# Digital audio production application
cask "reaper"
# Batch file renamer application
cask "renamer"
# File sync and share software
cask "resilio-sync"
cask "rubitrack-pro"
# Web browser
cask "safari-technology-preview"
cask "satellite-eyes"
# Word processing software with a typewriter style
cask "scrivener"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch"
cask "sketchup"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Text editor for code, markup and prose
cask "sublime-text"
# Backup, recovery and cloning software
cask "superduper"
# Application for inspecting installer packages
cask "suspicious-package"
# App to make lists and help with organization
cask "taskpaper"
# Inserts pre-made snippets of text anywhere
cask "textexpander"
# Application for interacting with Internet Relay Chat (IRC) chatrooms
cask "textual"
# Web browser focusing on security
cask "tor-browser"
# Git client focusing on power and productivity
cask "tower"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# JavaScript IDE
cask "webstorm"
# File system utility used to view and reclaim disk space
cask "whatsize"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Chronicle Pro", id: 1280542517
mas "ColorSnapper2", id: 969418666
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "EchoHam", id: 873302145
mas "Exporter for Contacts", id: 402323447
mas "Fantastical", id: 975937182
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paletter", id: 1494948845
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PDFScanner", id: 410968114
mas "Pommie", id: 963504129
mas "Reeder", id: 1449412482
mas "Reeder", id: 1529448980
mas "Session", id: 1521432881
mas "Silicio", id: 933627574
mas "SonicWall Mobile Connect", id: 822514576
mas "Tweetbot", id: 1384080005
mas "UpHabit ", id: 1495261277
